#+BEGIN_SRC emacs-lisp
;; ;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+END_SRC

;; ;; Resources:
;; ;; - https://github.com/hlissner/doom-emacs/blob/develop/modules
;; ;; - https://github.com/zaiste/.doom.d/
;; ;;   - the screencast guy
;; ;; - https://github.com/rschmukler/doom.d
;; ;; - https://github.com/ar1a/dotfiles/blob/master/emacs/.doom.d
;; ;; - https://github.com/forrestchang/.doom.d
;; ;; - and https://github.com/search?l=Emacs+Lisp&o=desc&q=%22.doom.d%22&s=stars&type=Repositories
;; ;; - https://tecosaur.github.io/emacs-config/config.html
;; TODO my terminal mode - make it a private package
;; (xclip-mode -1)

** Configuring bibliography management

#+BEGIN_SRC emacs-lisp
(setq my-bibliography-files '("~/Sync/Papers/references.bib"))
(setq my-bibliography-artifacts '("~/Sync/Papers/Artifacts"))
(setq my-bibliography-notes "~/Sync/Notes/Journal/Bibliography.org")
(setq my-bibliography-readling-list "~/Sync/Notes/Journal/Readings.org")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun my-find-file-external (fpath)
  (call-process shell-file-name nil
                nil nil
                shell-command-switch
                (format "%s %s"
                        (if (eq system-type 'darwin)
                            "open"
                          "xdg-open")
                        (shell-quote-argument fpath))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(after! ivy-bibtex

  (setq bibtex-completion-pdf-open-function
        (lambda (fpath)
          (if (string= (file-name-extension fpath) "pdf")
              (find-file fpath)
            (my-find-file-external fpath))))

  (defun my-bibtex-completion-open-pdf-external (keys &optional fallback-action)
    (let ((bibtex-completion-pdf-open-function 'my-find-file-external))
      (bibtex-completion-open-pdf keys fallback-action)))

  ;; from: https://github.com/org-roam/org-roam-bibtex
  (defun orb-process-file-field (citekey)
    "Process the 'file' BibTeX field and resolve if there are multiples.
     Search the disk for the document associated with this BibTeX
     entry.  The disk matching is based on looking in the
     `bibtex-completion-library-path' for a file with the
     CITEKEY.
     \(Mendeley, Zotero, normal paths) are all supported.  If there
     are multiple files found the user is prompted to select which one
     to enter"
    (let* ((entry (bibtex-completion-get-entry citekey))
           (paths (bibtex-completion-find-pdf entry)))
      (if (= (length paths) 1)
          (car paths)
        (completing-read "File to use: " paths))))

  (ivy-bibtex-ivify-action my-bibtex-completion-open-pdf-external my-ivy-bibtex-open-pdf-external)

  (ivy-add-actions
   'ivy-bibtex
   '(("E" my-ivy-bibtex-open-pdf-external "Open file in external viewer")
     ("c" ivy-bibtex-insert-citation "Insert citation")
     ("r" ivy-bibtex-insert-reference "Insert reference")))

  (setq bibtex-completion-bibliography my-bibliography-files
        bibtex-completion-library-path my-bibliography-artifacts
        bibtex-completion-notes-path my-bibliography-notes
        bibtex-completion-notes-template-one-file (concat
                                                   "\n"
                                                   "* ${author-or-editor} (${year}): ${title}\n"
                                                   "  :PROPERTIES:\n"
                                                   "  :Custom_ID: ${=key=}\n"
                                                   "  :NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
                                                   "  :URL: ${url}"
                                                   "  :DOI: ${doi}\n"
                                                   "  :END:\n\n"))
(add-to-list 'ivy-height-alist `(ivy-bibtex . ,(length (plist-get ivy--actions-list 'ivy-bibtex)))))
#+END_SRC

#+RESULTS:
: ((ivy-bibtex . 13) (counsel-evil-registers . 5) (counsel-yank-pop . 5) (counsel-git-log . 4))

Other files than PDF have to specify the file in the =file= field of the bibtex
entry.

#+BEGIN_SRC emacs-lisp
(after! org-noter
  (setq org-noter-default-notes-file-names `(,my-bibliography-notes)))
#+END_SRC

Based on the draft of the [[https://github.com/hlissner/doom-emacs/blob/5bc10f8b75a8d08ad37eb3cff15347b46d0427e6/modules/tools/biblio/config.el][biblio doom module]]
